Revit 2027 API
ThermalAsset Methods
The ThermalAsset type exposes the following members.
Methods
Name | Description
Copy |  Produces a copy of the asset.
Dispose
Equals(Object) | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Equals(ThermalAsset) |  Determines whether this thermal asset is equal to another.
EqualsThermalOnly |  Determines whether this thermal asset is equal to another, but ignore data from base class.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace